CSI API ETABS v1
cDetailing.GetDetailedBeamLineGuidData Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedBeamLineGuidData(
	string BeamLineID,
	string SimilarFirstBeamUniqueID,
	ref string[] LongitudinalABars,
	ref string[] LongitudinalBBars,
	ref string[] LongitudinalCBars,
	ref string[] LongitudinalDBars,
	ref string[] LongitudinalEBars,
	ref string[] LongitudinalFBars,
	ref string[] LongitudinalGBars,
	ref string[] LongitudinalHBars,
	ref string[] ZoneATies,
	ref string[] ZoneBTies,
	ref string[] ZoneCTies
)
Function GetDetailedBeamLineGuidData (
	BeamLineID As String,
	SimilarFirstBeamUniqueID As String,
	ByRef LongitudinalABars As String(),
	ByRef LongitudinalBBars As String(),
	ByRef LongitudinalCBars As String(),
	ByRef LongitudinalDBars As String(),
	ByRef LongitudinalEBars As String(),
	ByRef LongitudinalFBars As String(),
	ByRef LongitudinalGBars As String(),
	ByRef LongitudinalHBars As String(),
	ByRef ZoneATies As String(),
	ByRef ZoneBTies As String(),
	ByRef ZoneCTies As String()
) As Integer
Dim instance As cDetailing
Dim BeamLineID As String
Dim SimilarFirstBeamUniqueID As String
Dim LongitudinalABars As String()
Dim LongitudinalBBars As String()
Dim LongitudinalCBars As String()
Dim LongitudinalDBars As String()
Dim LongitudinalEBars As String()
Dim LongitudinalFBars As String()
Dim LongitudinalGBars As String()
Dim LongitudinalHBars As String()
Dim ZoneATies As String()
Dim ZoneBTies As String()
Dim ZoneCTies As String()
Dim returnValue As Integer
returnValue = instance.GetDetailedBeamLineGuidData(BeamLineID,
	SimilarFirstBeamUniqueID, LongitudinalABars,
	LongitudinalBBars, LongitudinalCBars,
	LongitudinalDBars, LongitudinalEBars,
	LongitudinalFBars, LongitudinalGBars,
	LongitudinalHBars, ZoneATies, ZoneBTies,
	ZoneCTies)
int GetDetailedBeamLineGuidData(
	String^ BeamLineID,
	String^ SimilarFirstBeamUniqueID,
	array<String^>^% LongitudinalABars,
	array<String^>^% LongitudinalBBars,
	array<String^>^% LongitudinalCBars,
	array<String^>^% LongitudinalDBars,
	array<String^>^% LongitudinalEBars,
	array<String^>^% LongitudinalFBars,
	array<String^>^% LongitudinalGBars,
	array<String^>^% LongitudinalHBars,
	array<String^>^% ZoneATies,
	array<String^>^% ZoneBTies,
	array<String^>^% ZoneCTies
)
abstract GetDetailedBeamLineGuidData :
        BeamLineID : string *
        SimilarFirstBeamUniqueID : string *
        LongitudinalABars : string[] byref *
        LongitudinalBBars : string[] byref *
        LongitudinalCBars : string[] byref *
        LongitudinalDBars : string[] byref *
        LongitudinalEBars : string[] byref *
        LongitudinalFBars : string[] byref *
        LongitudinalGBars : string[] byref *
        LongitudinalHBars : string[] byref *
        ZoneATies : string[] byref *
        ZoneBTies : string[] byref *
        ZoneCTies : string[] byref -> int
Parameters
BeamLineID
Type: System.String
SimilarFirstBeamUniqueID
Type: System.String
LongitudinalABars
Type: System.String[]
LongitudinalBBars
Type: System.String[]
LongitudinalCBars
Type: System.String[]
LongitudinalDBars
Type: System.String[]
LongitudinalEBars
Type: System.String[]
LongitudinalFBars
Type: System.String[]
LongitudinalGBars
Type: System.String[]
LongitudinalHBars
Type: System.String[]
ZoneATies
Type: System.String[]
ZoneBTies
Type: System.String[]
ZoneCTies
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDetailing Interface
ETABSv1 Namespace